{"basics":{"name":"Brandon Hubbard","label":"WordPress Developer","picture":"http://www.gravatar.com/avatar/3596404cbc9ffb7d4f48524e08340d86.png","email":"bkhubbard@gmail.com","phone":"(818) 297-4175","website":"https://brandonhubbard.com","summary":"I am the CTO for a startup called imFORZA based out of El Segundo, CA.","location":{"address":"7410 Jason Ave.","postalCode":"91307","city":"West Hills","countryCode":"US","region":"California"},"profiles":[{"url":"https://twitter.com/bhubbard","username":"bhubbard","network":"Twitter"},{"url":"https://github.com/bhubbard","username":"bhubbard","network":"Github"},{"url":"//www.facebook.com/bkhubbard","username":"bkhubbard","network":"Facebook"},{"url":"www.linkedin.com/in/brandonhubbard/","username":"brandonhubbard","network":"LinkedIn"},{"url":"//bitbucket.org/bhubbard","username":"bhubbard","network":"BitBucket"},{"url":"//plus.google.com/+BrandonHubbarddotcom","username":"BrandonHubbarddotcom","network":"Google Plus"},{"url":"//www.pinterest.com/bkhubbard/","username":"bkhubbard","network":"Pinterest"},{"url":"//instagram.com/bkhubbard","username":"bkhubbard","network":"Instagram"}]},"work":[{"highlights":["Brought web-development in-house to improve quality of work, and reduce costs. Introduced new development tools and standards such as git, and local development practices.","Introduced Web Hosting as a service to offer clients a complete management package. This changed a -$5,000/year cost into a +$3000/month revenue stream.  ","Started a true client support system to provide better accountability, and provide tracking of common issues and questions.","Opened a partnership with IDX Broker to provide IDX services to clients, creating a new revenue stream of +$3000/month"],"summary":"imFORZA is a web development firm focusing in providing website and marketing solutions.","endDate":"2015-01-01","startDate":"2012-01-01","website":"//www.imforza.com","position":"Director of Technology","company":"imFORZA"},{"highlights":["Created a new team responsible for monitoring and managing any service disruptions.","Wrote over 200 pages of new technical documentation in the KnowledgeBase to assist customers and support agents.","Provided detailed updates on the company status blog regarding any service disruptions usually within minutes of occurrence regardless of day or time.","Reviewed and updated content on customer facing sites and tools such as the company website or AccountCenter.","Reviewed and routed customer/employee requests regarding product bugs and features.","Managed and accelerated development of the Community Wiki.","Surpassed total call/ticket numbers over all previous agents within my first month while still maintaining a dedicated high level of customer service.","Evaluated, trained and provided on-going support for many of the new agents hired within the department.","Decreased agent call times over 50% by working with developers to design a new user interface for agents taking calls within the custom ticketing system."],"summary":"Since 1998, Media Temple has been on a mission to help web developers, designers, digital entrepreneurs, and innovators bring their ideas to life online.","endDate":"2011-03-01","startDate":"2007-10-01","website":"//mediatemple.net","position":"Support Agent / Technical Communications / Product Owner","company":"(mt) Media Temple"},{"highlights":["Built and maintained Windows servers, and managed networks in multiple offices.","Created and maintained several websites, mostly Joomla or standard HTML/CSS.","Researched and tested low-cost voip solution using Asterisk for several offices.","Performed regular hardware and software repairs for desktops, laptops and other mobile devices."],"summary":"The statewide CFT is made up of more than 140 local unions. Its public education membership includes EC/K-12 teachers, classified employees, community college instructors, adult educators, and University of California lecturers and librarians. The IT Department was responsible for managing all IT services for the 10 administrative offices located in various locations around the state, and some limited IT services for the 140 local unions.","endDate":"2007-10-01","startDate":"2004-03-01","website":"//cft.org","position":"Jr. Network Administrator","company":"California Federation Of Teachers"},{"highlights":["Introduced ski/snowboard skills to resort guests at various ages and skill levels.","Evaluated and provided on-going training for new instructors using AASI & PSIA national standards.","Created professionally designed excel worksheets allowing management to keep better track of daily visitors. ","Designed personal business card to pass out to clients as marketing for private lessons."],"summary":"On weekends, I served as a professional ski/snowboard instructor. Along with teaching as an instructor, I was responsible for multiple duties such as: clearing pathways of snow, managing student sign-in/check-out, equipment cleaning, guest information, and small carpet operations.","endDate":"2007-05-01","startDate":"2004-01-01","website":"//www.mthigh.com","position":"Ski & Snowboard Instructor","company":"Mountain Hight Resorts"}],"volunteer":[],"education":[{"courses":[],"gpa":"","endDate":"2005-01-01","startDate":"2003-01-01","studyType":"","area":"Information Technology","institution":"California State University Northridge"},{"courses":[],"gpa":"","endDate":"2003-01-01","startDate":"2001-01-01","studyType":"Associate of Arts","area":"Liberal Arts and Science","institution":"Los Angeles Pierce College"}],"awards":[],"publications":[],"skills":[{"keywords":["HTML","CSS","Javascript","WordPress","Git","SVN"],"level":"Master","name":"Web Development"}],"languages":[{"fluency":"Native speaker","language":"English"}],"interests":[{"keywords":["Canon Rebel T3i"],"name":"Photography"}],"references":[{"reference":"Brandon's knowledge and insight has always impressed me. When analyzing a given problem, he frequently arrived at \"the big picture\" before many of his peers. He was able to see the problem and solution quickly and clearly, and could effectively communicate his point of view.   At (mt) Media Temple, his contributions became cornerstones for many departments/initiatives, and much of that work lives on to this day. He has also consistently exhibited a strong grasp of current trends in the technology world; oftentimes, that knowledge helped to shape the path of a given initiative. I definitely recommend him as a true technology evangelist, as an innovative thinker, and as someone who leads by example.","name":"Nicholas Miller"},{"reference":"Brandon Hubbard was a fantastic person to work with. Strong team player. Makes the impossible possible.","name":"Robert Gregory"},{"reference":"I am pleased to give Brandon Hubbard my full endorsement!  I worked closely with Brandon for more than a year on several special projects as well as ongoing collaborations. Brandon is skillful at getting to the essence of a technical subject, validating it, then transforming it for use by a less technical audience.  He also did some amazing work analyzing large data sets and produced breakthrough opportunities as a result. He dramatically improved communication - enabling some individuals to achieve increases in excess of 200% in the number of inquiries handled while maintaining a high satisfaction rating by customers.  His constant exploration of industry happenings, trends, influencers, and organizations made him a gold-mine of ideas and information. He seemed always to be two steps ahead. He is a team player with a low-key personal style, and I enjoyed working with him. ","name":"Michael Robinson"},{"reference":"Mr. Hubbard is exceptionally efficient, dedicated, and always eager to go beyond the call of duty to provide extra services and in-depth assistance. He is highly respected and liked by his peers, and works well with everyone within and outside of our department.","name":"Martin C. Mota"}]}
